### Terraform Plan `4e8fb81061c7b71a6ff37e0bf796e004eb425d2c`
  <details>
  <summary>Show Plan</summary>
  
  ```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.db_private_subnet_group.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "main-private-db-sg"
      + name_prefix             = (known after apply)
      + region                  = "eu-west-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "main-private-db-sg"
        }
      + tags_all                = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-db-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                  = (known after apply)
    }

  # module.db_public_subnet_group.aws_db_subnet_group.this will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "main-public-db-sg"
      + name_prefix             = (known after apply)
      + region                  = "eu-west-1"
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name" = "main-public-db-sg"
        }
      + tags_all                = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-db-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                  = (known after apply)
    }

  # module.ecs_cluster_production.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "production"
      + region   = "eu-west-1"
      + tags_all = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster_staging.aws_ecs_cluster.this will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "staging"
      + region   = "eu-west-1"
      + tags_all = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.igw.aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "eu-west-1"
      + tags     = {
          + "Name" = "main-igw"
        }
      + tags_all = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-igw"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id   = (known after apply)
    }

  # module.nat_gateway.aws_eip.this will be created
  + resource "aws_eip" "this" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "eu-west-1"
      + tags                 = {
          + "Name" = "main-nat-gateway-eip"
        }
      + tags_all             = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-nat-gateway-eip"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
    }

  # module.nat_gateway.aws_nat_gateway.this will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "eu-west-1"
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Name" = "main-nat-gateway"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-nat-gateway"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
    }

  # module.private_route_table.aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + nat_gateway_id             = (known after apply)
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "main-private-route-table"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-route-table"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id           = (known after apply)
    }

  # module.private_route_table_subnet_association.aws_route_table_association.this[0] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_route_table_subnet_association.aws_route_table_association.this[1] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_route_table_subnet_association.aws_route_table_association.this[2] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.private_subnet_network_acl[0].aws_network_acl.this will be created
  + resource "aws_network_acl" "this" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + region     = "eu-west-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "main-private-subnet-nacl-1"
        }
      + tags_all   = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-subnet-nacl-1"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id     = (known after apply)
    }

  # module.private_subnet_network_acl[0].aws_network_acl_association.this will be created
  + resource "aws_network_acl_association" "this" {
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + region         = "eu-west-1"
      + subnet_id      = (known after apply)
    }

  # module.private_subnet_network_acl[1].aws_network_acl.this will be created
  + resource "aws_network_acl" "this" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + region     = "eu-west-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "main-private-subnet-nacl-2"
        }
      + tags_all   = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-subnet-nacl-2"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id     = (known after apply)
    }

  # module.private_subnet_network_acl[1].aws_network_acl_association.this will be created
  + resource "aws_network_acl_association" "this" {
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + region         = "eu-west-1"
      + subnet_id      = (known after apply)
    }

  # module.private_subnet_network_acl[2].aws_network_acl.this will be created
  + resource "aws_network_acl" "this" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + region     = "eu-west-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "main-private-subnet-nacl-3"
        }
      + tags_all   = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-subnet-nacl-3"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id     = (known after apply)
    }

  # module.private_subnet_network_acl[2].aws_network_acl_association.this will be created
  + resource "aws_network_acl_association" "this" {
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + region         = "eu-west-1"
      + subnet_id      = (known after apply)
    }

  # module.private_subnets.aws_subnet.this[0] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.48.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "Name" = "main-private-subnet-1"
          + "Tier" = "private"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-subnet-1"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.private_subnets.aws_subnet.this[1] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "Name" = "main-private-subnet-2"
          + "Tier" = "private"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-subnet-2"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.private_subnets.aws_subnet.this[2] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "Name" = "main-private-subnet-3"
          + "Tier" = "private"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-private-subnet-3"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
          + "Tier"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_route_table.aws_route_table.this will be created
  + resource "aws_route_table" "this" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "eu-west-1"
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Name" = "main-public-route-table"
        }
      + tags_all         = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-route-table"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id           = (known after apply)
    }

  # module.public_route_table_subnet_association.aws_route_table_association.this[0] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_route_table_subnet_association.aws_route_table_association.this[1] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_route_table_subnet_association.aws_route_table_association.this[2] will be created
  + resource "aws_route_table_association" "this" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.public_subnet_network_acl[0].aws_network_acl.this will be created
  + resource "aws_network_acl" "this" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + region     = "eu-west-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "main-public-subnet-nacl-1"
        }
      + tags_all   = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-subnet-nacl-1"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id     = (known after apply)
    }

  # module.public_subnet_network_acl[0].aws_network_acl_association.this will be created
  + resource "aws_network_acl_association" "this" {
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + region         = "eu-west-1"
      + subnet_id      = (known after apply)
    }

  # module.public_subnet_network_acl[1].aws_network_acl.this will be created
  + resource "aws_network_acl" "this" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + region     = "eu-west-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "main-public-subnet-nacl-2"
        }
      + tags_all   = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-subnet-nacl-2"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id     = (known after apply)
    }

  # module.public_subnet_network_acl[1].aws_network_acl_association.this will be created
  + resource "aws_network_acl_association" "this" {
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + region         = "eu-west-1"
      + subnet_id      = (known after apply)
    }

  # module.public_subnet_network_acl[2].aws_network_acl.this will be created
  + resource "aws_network_acl" "this" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + region     = "eu-west-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "main-public-subnet-nacl-3"
        }
      + tags_all   = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-subnet-nacl-3"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id     = (known after apply)
    }

  # module.public_subnet_network_acl[2].aws_network_acl_association.this will be created
  + resource "aws_network_acl_association" "this" {
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + region         = "eu-west-1"
      + subnet_id      = (known after apply)
    }

  # module.public_subnets.aws_subnet.this[0] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "Name" = "main-public-subnet-1"
          + "Tier" = "public"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-subnet-1"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
          + "Tier"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnets.aws_subnet.this[1] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "Name" = "main-public-subnet-2"
          + "Tier" = "public"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-subnet-2"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
          + "Tier"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.public_subnets.aws_subnet.this[2] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "Name" = "main-public-subnet-3"
          + "Tier" = "public"
        }
      + tags_all                                       = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-public-subnet-3"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
          + "Tier"        = "public"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.security_group_egress_all.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-egress-all-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-egress-all-sg"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-egress-all-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group_egress_all_egress.aws_vpc_security_group_egress_rule.ipv4 will be created
  + resource "aws_vpc_security_group_egress_rule" "ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-egress-all-sg-outbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-egress-all-sg-outbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = -1
    }

  # module.security_group_egress_all_egress.aws_vpc_security_group_egress_rule.ipv6 will be created
  + resource "aws_vpc_security_group_egress_rule" "ipv6" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-egress-all-sg-outbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-egress-all-sg-outbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = -1
    }

  # module.security_group_http.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-http-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-http-sg"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-http-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group_http_ingress.aws_vpc_security_group_ingress_rule.ipv4 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-http-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-http-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 80
    }

  # module.security_group_http_ingress.aws_vpc_security_group_ingress_rule.ipv6 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv6" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-http-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-http-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 80
    }

  # module.security_group_https.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-https-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-https-sg"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-https-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group_https_ingress.aws_vpc_security_group_ingress_rule.ipv4 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-https-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-https-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 443
    }

  # module.security_group_https_ingress.aws_vpc_security_group_ingress_rule.ipv6 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv6" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-https-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-https-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 443
    }

  # module.security_group_ingress_3000.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-ingress-3000-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-ingress-3000-sg"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ingress-3000-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group_ingress_3000_ingress.aws_vpc_security_group_ingress_rule.ipv4 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 3000
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-ingress-3000-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ingress-3000-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 3000
    }

  # module.security_group_ingress_3000_ingress.aws_vpc_security_group_ingress_rule.ipv6 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv6" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + from_port              = 3000
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-ingress-3000-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ingress-3000-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 3000
    }

  # module.security_group_ingress_5432.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-ingress-5432-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-ingress-5432-sg"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ingress-5432-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group_ingress_5432_ingress.aws_vpc_security_group_ingress_rule.ipv4 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 5432
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-ingress-5432-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ingress-5432-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 5432
    }

  # module.security_group_ingress_5432_ingress.aws_vpc_security_group_ingress_rule.ipv6 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv6" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + from_port              = 5432
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-ingress-5432-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ingress-5432-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 5432
    }

  # module.security_group_ssh.aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-ssh-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-ssh-sg"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ssh-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.security_group_ssh_ingress.aws_vpc_security_group_ingress_rule.ipv4 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv4" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-ssh-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ssh-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 22
    }

  # module.security_group_ssh_ingress.aws_vpc_security_group_ingress_rule.ipv6 will be created
  + resource "aws_vpc_security_group_ingress_rule" "ipv6" {
      + arn                    = (known after apply)
      + cidr_ipv6              = "::/0"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "TCP"
      + region                 = "eu-west-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name" = "main-ssh-sg-inbound"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-ssh-sg-inbound"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + to_port                = 22
    }

  # module.vpc.aws_default_network_acl.this will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + tags                   = {
          + "Name" = "main-default-nacl"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-default-nacl"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.this will be created
  + resource "aws_default_route_table" "this" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + route                  = [
          + {
              + cidr_block                 = "10.0.0.0/16"
              + gateway_id                 = "local"
                # (10 unchanged attributes hidden)
            },
        ]
      + tags                   = {
          + "Name" = "main-default-route-table"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-default-route-table"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_default_security_group.this will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = true
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "main-default-sg"
        }
      + tags_all               = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main-default-sg"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "eu-west-1"
      + tags                                 = {
          + "Name" = "main"
        }
      + tags_all                             = {
          + "Environment" = "production"
          + "ManagedVia"  = "Terraform"
          + "Name"        = "main"
          + "Project"     = "https://github.com/shahid-2020/infrastructure-aws-manager"
        }
    }

Plan: 55 to add, 0 to change, 0 to destroy.

```
  </details>
  
  *Binary plan file available as workflow artifact*